artillery-server.yaml
config:
  target: http://127.0.0.1:3001
  phases:
    - duration: 60
      arrivalRate: 1
      name: "1 RPS"
    - duration: 60
      arrivalRate: 10
      name: "10 RPS"
    - duration: 60
      arrivalRate: 100
      name: "100 RPS"
    - duration: 60
      arrivalRate: 1000
      name: "1000 RPS"

scenarios:
  - flow:
    - put:
        url: "/api/user/update"
        json:
          user:
            id: "4"
            name: "sweet"
            last: "baby"
            username: "dwarner"
            password: "password"
            sex: "male"
            email: "dwarner@gmail.com"
            city: "portland"
            state: "oregon"
            zip: "22456"